In [50]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re
%matplotlib inline

# Global Variable Declaration/Misc

In [51]:
regex = re.compile('[@_!#$%^&*()<>?/\|}{~:]')

# Load Data

In [82]:
df_bom = pd.read_csv('data/bom.movie_gross.csv.gz')
df_imdb_akas = pd.read_csv('data/imdb.title.akas.csv.gz')
df_budgets = pd.read_csv('data/tn.movie_budgets.csv.gz')

# Visualize/Explore Data

### <span style='color:red'>------AKAS DF</span>

In [77]:
print(df_imdb_akas.shape, '\n')
print(df_imdb_akas.info())
df_imdb_akas.head()

(331703, 9)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 9 columns):
title_id             331703 non-null object
ordering             331703 non-null int64
title                331703 non-null object
region               278410 non-null object
language             41715 non-null object
types                168447 non-null object
attributes           14925 non-null object
is_original_title    331678 non-null float64
title_CLEANED        331703 non-null object
dtypes: float64(1), int64(1), object(7)
memory usage: 22.8+ MB
None

,title_id,ordering,title,region,language,types,attributes,is_original_title,title_CLEANED
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0,Джурасик свят
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0,Jurashikku warudo
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0,Jurassic World O Mundo dos Dinossauros
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0,O Mundo dos Dinossauros
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0,Jurassic World

### <span style='color:red'>------BOM DF</span>

In [72]:
print(df_bom.shape, '\n')
print(df_bom.info())
df_bom.head()

(3387, 6)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 6 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
title_CLEANED     3387 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 158.8+ KB
None

,title,studio,domestic_gross,foreign_gross,year,title_CLEANED
0,Toy Story 3,BV,415000000.0,652000000,2010,Toy Story 3
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010,Alice in Wonderland 2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010,Harry Potter and the Deathly Hallows Part 1
3,Inception,WB,292600000.0,535700000,2010,Inception
4,Shrek Forever After,P/DW,238700000.0,513900000,2010,Shrek Forever After

### <span style='color:red'>------BUDGETS DF</span>

In [85]:
print(df_budgets.shape, '\n')
print(df_budgets.info())
df_budgets.head()

(5782, 7)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 7 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
title_CLEANED        5782 non-null object
dtypes: int64(1), object(6)
memory usage: 316.3+ KB
None

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,title_CLEANED
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",avatar
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",pirates of the caribbean on stranger tides
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",dark phoenix
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",avengers age of ultron
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",star wars ep. viii the last jedi

# Clean Data

### <span style='color:red'>------AKAS DF</span>

In [78]:
df_imdb_akas['title_CLEANED'] = df_imdb_akas['title'].apply(lambda x: x.lower())
df_imdb_akas['title_CLEANED'] = df_imdb_akas['title_CLEANED'].apply(lambda x: re.sub('[@_!#$%^&*()<>?/\|}{~:]', '', x))

### <span style='color:red'>------BOM DF</span>

In [79]:
df_bom['title_CLEANED'] = df_bom['title'].apply(lambda x: x.lower())
df_bom['title_CLEANED'] = df_bom['title_CLEANED'].apply(lambda x: re.sub('[@_!#$%^&*()<>?/\|}{~:]', '', x))

### <span style='color:red'>------BUDGETS DF</span>

In [84]:
df_budgets['title_CLEANED'] = df_budgets['movie'].apply(lambda x: x.lower())
df_budgets['title_CLEANED'] = df_budgets['title_CLEANED'].apply(lambda x: re.sub('[@_!#$%^&*()<>?/\|}{~:]', '', x))

# Merge Data

In [80]:
df_bom_akas = pd.merge(df_imdb_akas, df_bom,  on="title_CLEANED")
df_bom_akas = pd.merge(df_imdb_akas, df_bom,  on="title_CLEANED")

In [81]:
df_bom_akas =

,title_id,ordering,title_x,region,language,types,attributes,is_original_title,title_CLEANED,title_y,studio,domestic_gross,foreign_gross,year
0,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
1,tt0369610,15,Jurassic World,GR,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
2,tt0369610,16,Jurassic World,IT,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
3,tt0369610,20,Jurassic World,SE,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
4,tt0369610,29,Jurassic World,US,NaN,NaN,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
5,tt0369610,31,Jurassic World,RO,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
6,tt0369610,33,Jurassic World,FI,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
7,tt0369610,37,Jurassic World,NO,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
8,tt0369610,40,Jurassic World,DK,NaN,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015
9,tt0369610,43,Jurassic World,TR,tr,imdbDisplay,NaN,0.0,jurassic world,Jurassic World,Uni.,652300000.0,"1,019.4",2015

In [14]:
imdb_basics = pd.read_csv('data/imdb.title.basics.csv.gz')
print(imdb_basics.shape, '\n')
print(imdb_basics.info())

(146144, 6)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB
None

In [25]:
imdb_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,genres_CLEANED
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama","['Action,Crime,Drama']"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama","['Biography,Drama']"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,['Drama']
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama","['Comedy,Drama']"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy","['Comedy,Drama,Fantasy']"

In [24]:
imdb_basics['genres_CLEANED']  = imdb_basics['genres']
imdb_basics['genres_CLEANED'].dropna(inplace=True)
imdb_basics['genres_CLEANED'] = imdb_basics['genres_CLEANED'].apply(lambda x: str(x.split()))

In [7]:
imdb_crew = pd.read_csv('data/imdb.title.crew.csv.gz')
print(imdb_crew.shape, '\n')
print(imdb_crew.info())
imdb_crew.head()

(146144, 3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
tconst       146144 non-null object
directors    140417 non-null object
writers      110261 non-null object
dtypes: object(3)
memory usage: 3.3+ MB
None

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [8]:
imdb_principals = pd.read_csv('data/imdb.title.principals.csv.gz')
print(imdb_principals.shape, '\n')
print(imdb_principals.info())
imdb_principals.head()

(1028186, 6)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB
None

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [9]:
imdb_ratings = pd.read_csv('data/imdb.title.ratings.csv.gz')
print(imdb_ratings.shape, '\n')
print(imdb_ratings.info())
imdb_ratings.head()

(73856, 3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB
None

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [4]:
rt_info = pd.read_csv('data/rt.movie_info.tsv.gz', delimiter = '\t')
print(rt_info.shape, '\n')
print(rt_info.info())
rt_info.head()

(1560, 12)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
id              1560 non-null int64
synopsis        1498 non-null object
rating          1557 non-null object
genre           1552 non-null object
director        1361 non-null object
writer          1111 non-null object
theater_date    1201 non-null object
dvd_date        1201 non-null object
currency        340 non-null object
box_office      340 non-null object
runtime         1530 non-null object
studio          494 non-null object
dtypes: int64(1), object(11)
memory usage: 146.3+ KB
None

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [9]:
rt_info['box_office'].isna().count()

1560

In [11]:
rt_reviews = pd.read_csv('data/rt.reviews.tsv.gz', delimiter = '\t', encoding='windows-1252')
print(rt_reviews.shape, '\n')
print(rt_reviews.info())
rt_reviews.head()

(54432, 8)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
id            54432 non-null int64
review        48869 non-null object
rating        40915 non-null object
fresh         54432 non-null object
critic        51710 non-null object
top_critic    54432 non-null int64
publisher     54123 non-null object
date          54432 non-null object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB
None

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [12]:
tmdb = pd.read_csv('data/tmdb.movies.csv.gz')
print(tmdb.shape, '\n')
print(tmdb.info())
tmdb.head()

(26517, 10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB
None

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [13]:
budgets = pd.read_csv('data/tn.movie_budgets.csv.gz')
print(budgets.shape, '\n')
print(budgets.info())
budgets.head()

(5782, 6)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB
None

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"